###################################################################

# Created by write_sdc on Tue Oct  2 04:52:42 2018

###################################################################
set sdc_version 1.9

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 50 [get_ports {wb_dat_o[15]}]
set_load -pin_load 50 [get_ports {wb_dat_o[14]}]
set_load -pin_load 50 [get_ports {wb_dat_o[13]}]
set_load -pin_load 50 [get_ports {wb_dat_o[12]}]
set_load -pin_load 50 [get_ports {wb_dat_o[11]}]
set_load -pin_load 50 [get_ports {wb_dat_o[10]}]
set_load -pin_load 50 [get_ports {wb_dat_o[9]}]
set_load -pin_load 50 [get_ports {wb_dat_o[8]}]
set_load -pin_load 50 [get_ports {wb_dat_o[7]}]
set_load -pin_load 50 [get_ports {wb_dat_o[6]}]
set_load -pin_load 50 [get_ports {wb_dat_o[5]}]
set_load -pin_load 50 [get_ports {wb_dat_o[4]}]
set_load -pin_load 50 [get_ports {wb_dat_o[3]}]
set_load -pin_load 50 [get_ports {wb_dat_o[2]}]
set_load -pin_load 50 [get_ports {wb_dat_o[1]}]
set_load -pin_load 50 [get_ports {wb_dat_o[0]}]
set_load -pin_load 50 [get_ports wb_ack_o]
set_load -pin_load 50 [get_ports pit_o]
set_load -pin_load 50 [get_ports pit_irq_o]
set_load -pin_load 50 [get_ports cnt_flag_o]
set_load -pin_load 50 [get_ports cnt_sync_o]
set_max_transition 0.1875 [get_ports {wb_adr_i[2]}]
set_max_transition 0.1875 [get_ports {wb_adr_i[1]}]
set_max_transition 0.1875 [get_ports {wb_adr_i[0]}]
set_max_transition 0.1875 [get_ports {wb_dat_i[15]}]
set_max_transition 0.1875 [get_ports {wb_dat_i[14]}]
set_max_transition 0.1875 [get_ports {wb_dat_i[13]}]
set_max_transition 0.1875 [get_ports {wb_dat_i[12]}]
set_max_transition 0.1875 [get_ports {wb_dat_i[11]}]
set_max_transition 0.1875 [get_ports {wb_dat_i[10]}]
set_max_transition 0.1875 [get_ports {wb_dat_i[9]}]
set_max_transition 0.1875 [get_ports {wb_dat_i[8]}]
set_max_transition 0.1875 [get_ports {wb_dat_i[7]}]
set_max_transition 0.1875 [get_ports {wb_dat_i[6]}]
set_max_transition 0.1875 [get_ports {wb_dat_i[5]}]
set_max_transition 0.1875 [get_ports {wb_dat_i[4]}]
set_max_transition 0.1875 [get_ports {wb_dat_i[3]}]
set_max_transition 0.1875 [get_ports {wb_dat_i[2]}]
set_max_transition 0.1875 [get_ports {wb_dat_i[1]}]
set_max_transition 0.1875 [get_ports {wb_dat_i[0]}]
set_max_transition 0.1875 [get_ports wb_we_i]
set_max_transition 0.1875 [get_ports wb_stb_i]
set_max_transition 0.1875 [get_ports wb_cyc_i]
set_max_transition 0.1875 [get_ports {wb_sel_i[1]}]
set_max_transition 0.1875 [get_ports {wb_sel_i[0]}]
set_max_transition 0.1875 [get_ports ext_sync_i]
create_clock [get_ports wb_clk_i]  -period 1.25  -waveform {0 0.625}
set_clock_uncertainty -setup 0.05  [get_clocks wb_clk_i]
set_input_delay -clock wb_clk_i  -max 0.3125  [get_ports wb_rst_i]
set_input_delay -clock wb_clk_i  -min 0.1875  [get_ports wb_rst_i]
set_input_delay -clock wb_clk_i  -max 0.3125  [get_ports arst_i]
set_input_delay -clock wb_clk_i  -min 0.1875  [get_ports arst_i]
set_input_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_adr_i[2]}]
set_input_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_adr_i[2]}]
set_input_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_adr_i[1]}]
set_input_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_adr_i[1]}]
set_input_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_adr_i[0]}]
set_input_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_adr_i[0]}]
set_input_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_i[15]}]
set_input_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_i[15]}]
set_input_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_i[14]}]
set_input_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_i[14]}]
set_input_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_i[13]}]
set_input_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_i[13]}]
set_input_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_i[12]}]
set_input_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_i[12]}]
set_input_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_i[11]}]
set_input_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_i[11]}]
set_input_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_i[10]}]
set_input_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_i[10]}]
set_input_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_i[9]}]
set_input_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_i[9]}]
set_input_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_i[8]}]
set_input_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_i[8]}]
set_input_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_i[7]}]
set_input_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_i[7]}]
set_input_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_i[6]}]
set_input_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_i[6]}]
set_input_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_i[5]}]
set_input_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_i[5]}]
set_input_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_i[4]}]
set_input_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_i[4]}]
set_input_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_i[3]}]
set_input_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_i[3]}]
set_input_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_i[2]}]
set_input_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_i[2]}]
set_input_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_i[1]}]
set_input_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_i[1]}]
set_input_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_i[0]}]
set_input_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_i[0]}]
set_input_delay -clock wb_clk_i  -max 0.3125  [get_ports wb_we_i]
set_input_delay -clock wb_clk_i  -min 0.1875  [get_ports wb_we_i]
set_input_delay -clock wb_clk_i  -max 0.3125  [get_ports wb_stb_i]
set_input_delay -clock wb_clk_i  -min 0.1875  [get_ports wb_stb_i]
set_input_delay -clock wb_clk_i  -max 0.3125  [get_ports wb_cyc_i]
set_input_delay -clock wb_clk_i  -min 0.1875  [get_ports wb_cyc_i]
set_input_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_sel_i[1]}]
set_input_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_sel_i[1]}]
set_input_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_sel_i[0]}]
set_input_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_sel_i[0]}]
set_input_delay -clock wb_clk_i  -max 0.3125  [get_ports ext_sync_i]
set_input_delay -clock wb_clk_i  -min 0.1875  [get_ports ext_sync_i]
set_output_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_o[15]}]
set_output_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_o[15]}]
set_output_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_o[14]}]
set_output_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_o[14]}]
set_output_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_o[13]}]
set_output_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_o[13]}]
set_output_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_o[12]}]
set_output_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_o[12]}]
set_output_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_o[11]}]
set_output_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_o[11]}]
set_output_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_o[10]}]
set_output_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_o[10]}]
set_output_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_o[9]}]
set_output_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_o[9]}]
set_output_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_o[8]}]
set_output_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_o[8]}]
set_output_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_o[7]}]
set_output_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_o[7]}]
set_output_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_o[6]}]
set_output_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_o[6]}]
set_output_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_o[5]}]
set_output_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_o[5]}]
set_output_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_o[4]}]
set_output_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_o[4]}]
set_output_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_o[3]}]
set_output_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_o[3]}]
set_output_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_o[2]}]
set_output_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_o[2]}]
set_output_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_o[1]}]
set_output_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_o[1]}]
set_output_delay -clock wb_clk_i  -max 0.3125  [get_ports {wb_dat_o[0]}]
set_output_delay -clock wb_clk_i  -min 0.1875  [get_ports {wb_dat_o[0]}]
set_output_delay -clock wb_clk_i  -max 0.3125  [get_ports wb_ack_o]
set_output_delay -clock wb_clk_i  -min 0.1875  [get_ports wb_ack_o]
set_output_delay -clock wb_clk_i  -max 0.3125  [get_ports pit_o]
set_output_delay -clock wb_clk_i  -min 0.1875  [get_ports pit_o]
set_output_delay -clock wb_clk_i  -max 0.3125  [get_ports pit_irq_o]
set_output_delay -clock wb_clk_i  -min 0.1875  [get_ports pit_irq_o]
set_output_delay -clock wb_clk_i  -max 0.3125  [get_ports cnt_flag_o]
set_output_delay -clock wb_clk_i  -min 0.1875  [get_ports cnt_flag_o]
set_output_delay -clock wb_clk_i  -max 0.3125  [get_ports cnt_sync_o]
set_output_delay -clock wb_clk_i  -min 0.1875  [get_ports cnt_sync_o]
set_input_transition -max 0.0375  [get_ports {wb_adr_i[2]}]
set_input_transition -min 0.0375  [get_ports {wb_adr_i[2]}]
set_input_transition -max 0.0375  [get_ports {wb_adr_i[1]}]
set_input_transition -min 0.0375  [get_ports {wb_adr_i[1]}]
set_input_transition -max 0.0375  [get_ports {wb_adr_i[0]}]
set_input_transition -min 0.0375  [get_ports {wb_adr_i[0]}]
set_input_transition -max 0.0375  [get_ports {wb_dat_i[15]}]
set_input_transition -min 0.0375  [get_ports {wb_dat_i[15]}]
set_input_transition -max 0.0375  [get_ports {wb_dat_i[14]}]
set_input_transition -min 0.0375  [get_ports {wb_dat_i[14]}]
set_input_transition -max 0.0375  [get_ports {wb_dat_i[13]}]
set_input_transition -min 0.0375  [get_ports {wb_dat_i[13]}]
set_input_transition -max 0.0375  [get_ports {wb_dat_i[12]}]
set_input_transition -min 0.0375  [get_ports {wb_dat_i[12]}]
set_input_transition -max 0.0375  [get_ports {wb_dat_i[11]}]
set_input_transition -min 0.0375  [get_ports {wb_dat_i[11]}]
set_input_transition -max 0.0375  [get_ports {wb_dat_i[10]}]
set_input_transition -min 0.0375  [get_ports {wb_dat_i[10]}]
set_input_transition -max 0.0375  [get_ports {wb_dat_i[9]}]
set_input_transition -min 0.0375  [get_ports {wb_dat_i[9]}]
set_input_transition -max 0.0375  [get_ports {wb_dat_i[8]}]
set_input_transition -min 0.0375  [get_ports {wb_dat_i[8]}]
set_input_transition -max 0.0375  [get_ports {wb_dat_i[7]}]
set_input_transition -min 0.0375  [get_ports {wb_dat_i[7]}]
set_input_transition -max 0.0375  [get_ports {wb_dat_i[6]}]
set_input_transition -min 0.0375  [get_ports {wb_dat_i[6]}]
set_input_transition -max 0.0375  [get_ports {wb_dat_i[5]}]
set_input_transition -min 0.0375  [get_ports {wb_dat_i[5]}]
set_input_transition -max 0.0375  [get_ports {wb_dat_i[4]}]
set_input_transition -min 0.0375  [get_ports {wb_dat_i[4]}]
set_input_transition -max 0.0375  [get_ports {wb_dat_i[3]}]
set_input_transition -min 0.0375  [get_ports {wb_dat_i[3]}]
set_input_transition -max 0.0375  [get_ports {wb_dat_i[2]}]
set_input_transition -min 0.0375  [get_ports {wb_dat_i[2]}]
set_input_transition -max 0.0375  [get_ports {wb_dat_i[1]}]
set_input_transition -min 0.0375  [get_ports {wb_dat_i[1]}]
set_input_transition -max 0.0375  [get_ports {wb_dat_i[0]}]
set_input_transition -min 0.0375  [get_ports {wb_dat_i[0]}]
set_input_transition -max 0.0375  [get_ports wb_we_i]
set_input_transition -min 0.0375  [get_ports wb_we_i]
set_input_transition -max 0.0375  [get_ports wb_stb_i]
set_input_transition -min 0.0375  [get_ports wb_stb_i]
set_input_transition -max 0.0375  [get_ports wb_cyc_i]
set_input_transition -min 0.0375  [get_ports wb_cyc_i]
set_input_transition -max 0.0375  [get_ports {wb_sel_i[1]}]
set_input_transition -min 0.0375  [get_ports {wb_sel_i[1]}]
set_input_transition -max 0.0375  [get_ports {wb_sel_i[0]}]
set_input_transition -min 0.0375  [get_ports {wb_sel_i[0]}]
set_input_transition -max 0.0375  [get_ports ext_sync_i]
set_input_transition -min 0.0375  [get_ports ext_sync_i]
